<script setup lang="ts">
import {
  Sheet,
  SheetClose,
  SheetContent,
  SheetDescription,
  SheetFooter,
  SheetHeader,
  SheetTitle,
  SheetTrigger
} from "~/shared/ui/sheet"

import ModalTable from "./modal-table.vue"
</script>

<template>
  <Sheet>
    <SheetTrigger as-child>
      <slot />
    </SheetTrigger>
    <SheetContent class="py-2 pb-8 sm:max-w-lg">
      <SheetHeader class="px-8">
        <SheetTitle class="text-2xl">Доставка и сборка</SheetTitle>
      </SheetHeader>
      <div class="w-full space-y-6 overflow-y-auto px-8">
        <p class="text-sm">
          При заказе стандартного изделия из каталога сайта стоимостью от 30 000
          рублей, на него распространяется Акция «Бесплатная доставка». Акция
          действует только по г. Москва, в пределах МКАД. Доставка за МКАД
          оплачивается дополнительно, стоимость - 40 ₽/км (до 80 км от МКАД) и
          50 ₽/км (от 80 км от МКАД). Акция «Бесплатная доставка» не применяется
          при покупке мебели в Рассрочку и не суммируется с промокодами. О
          наличии акций в других регионах уточняйте у менеджера по телефону
          компании.
        </p>

        <h3 class="scroll-m-20 text-xl font-medium">Стоимость услуг</h3>

        <ModalTable
          title="Доставка"
          :items="[
            {
              label: 'Шкафы, стенки: длина менее 2300, высота менее 2500',
              value: '1390 ₽'
            },
            {
              label: 'Шкафы, стенки: длина более 2299, высота более 2499',
              value: '1690 ₽'
            },
            {
              label: 'Модульные гардеробные, прихожие, библиотеки (за модуль)',
              value: '590 ₽'
            },
            {
              label: 'Тумбы (кроме прикроватных), столы, комоды',
              value: '1190 ₽'
            },
            {
              label: 'Тумбы прикроватные, полки, антресоли, зеркало навесное',
              value: '490 ₽'
            },
            {
              label: 'Кровати, стеллажи, пеналы',
              value: '1190 ₽'
            },
            {
              label: 'Кухни в собранном виде (за модуль)',
              value: '400 ₽'
            },
            {
              label: 'Кухни в разобранном виде',
              value: '1490 ₽'
            },
            {
              label: 'Пронос изделий до подъезда (от 50 метров)',
              value: '100 ₽ / 10 м.'
            }
          ]"
        />

        <ModalTable
          title="Подъем вручную"
          :items="[
            {
              label: 'Шкафы, стенки: длина менее 2300, высота менее 2500',
              value: '500 ₽ / этаж'
            },
            {
              label: 'Шкафы, стенки: длина более 2299, высота более 2499',
              value: '700 ₽ / этаж'
            },
            {
              label: 'Модульные гардеробные, прихожие, библиотеки (за модуль)',
              value: '300 ₽ / этаж'
            },
            {
              label: 'Тумбы (кроме прикроватных), столы, комоды',
              value: '400 ₽ / этаж'
            },
            {
              label: 'Тумбы прикроватные, полки, антресоли, зеркало навесное',
              value: '250 ₽ / этаж'
            },
            {
              label: 'Кровати, стеллажи, пеналы',
              value: '400 ₽ / этаж'
            },
            {
              label: 'Кухни в собранном виде (за модуль)',
              value: '150 ₽ / этаж'
            },
            {
              label: 'Кухни в разобранном виде',
              value: '500 ₽ / этаж'
            },
            {
              label:
                'Подъем негабаритных, длинномерных, деталей (только поэтажный)',
              value: '150/деталь'
            }
          ]"
        />

        <ModalTable
          title="Подъем на грузовом лифте"
          :items="[
            {
              label: 'Шкафы, стенки: длина менее 2300, высота менее 2500',
              value: '800 ₽'
            },
            {
              label: 'Шкафы, стенки: длина более 2299, высота более 2499',
              value: '1200 ₽'
            },
            {
              label: 'Модульные гардеробные, прихожие, библиотеки (за модуль)',
              value: '350 ₽'
            },
            {
              label: 'Тумбы (кроме прикроватных), столы, комоды',
              value: '600 ₽'
            },
            {
              label: 'Тумбы прикроватные, полки, антресоли, зеркало навесное',
              value: '350 ₽'
            },
            {
              label: 'Кровати, стеллажи, пеналы',
              value: '600 ₽'
            },
            {
              label: 'Кухни в собранном виде (за модуль)',
              value: '200 ₽'
            },
            {
              label: 'Кухни в разобранном виде',
              value: '1500 ₽'
            },
            {
              label:
                'Подъем негабаритных, длинномерных, деталей (только поэтажный)',
              value: 'нет'
            }
          ]"
        />

        <ModalTable
          title="Занос на 1 этаж"
          :items="[
            {
              label: 'Шкафы, стенки: длина менее 2300, высота менее 2500',
              value: '500 ₽'
            },
            {
              label: 'Шкафы, стенки: длина более 2299, высота более 2499',
              value: '700 ₽'
            },
            {
              label: 'Модульные гардеробные, прихожие, библиотеки (за модуль)',
              value: '300 ₽'
            },
            {
              label: 'Тумбы (кроме прикроватных), столы, комоды',
              value: '400 ₽'
            },
            {
              label: 'Тумбы прикроватные, полки, антресоли, зеркало навесное',
              value: '250 ₽'
            },
            {
              label: 'Кровати, стеллажи, пеналы',
              value: '400 ₽'
            },
            {
              label: 'Кухни в собранном виде (за модуль)',
              value: '150 ₽'
            },
            {
              label: 'Кухни в разобранном виде',
              value: '500 ₽'
            },
            {
              label:
                'Подъем негабаритных, длинномерных, деталей (только поэтажный)',
              value: '150/деталь'
            }
          ]"
        />

        <ul class="my-6 ml-6 list-disc text-sm [&>li]:mt-2">
          <li>
            Шкафы, прихожие, гардеробные, стенки, количеством упаковок более 11
            считаются по двойному тарифу за подъем и доставку, кроме доплаты за
            доставку за пределы МКАД.
          </li>
          <li>
            Доставка за пределы МКАД оплачивается дополнительно по тарифу: 40
            руб/км (до 80 км от МКАД) и 50 ₽/км (от 80 км от МКАД). Считается с
            1-го км от границы МКАД.
          </li>
          <li>
            Если ваш адрес расположен за МКАДом, то к стоимости сборки
            прибавляется стоимость за дорогу (указанная выше в условиях
            доставки), т.к. служба сборки работает отдельно от службы доставки.
          </li>
          <li>
            Оплата производится наличными курьеру по факту получения мебели. При
            получении вы можете осмотреть товар, проверить наличие документов
            (бланк заказа) и только после этого оплачивать заказ.
          </li>
          <li>
            Прикроватные тумбы могут быть доставлены в собранном виде
            (оговаривается при оформлении заказа).
          </li>
          <li>
            При предоставлении клиентом тележки для ручного проноса действует
            скидка 50% на услугу "Пронос изделий до подъезда" (Стоимость со
            скидкой - 50 ₽ / 10 метров).
          </li>
        </ul>

        <h3 class="scroll-m-20 text-xl font-medium">Сборка мебели</h3>

        <ul class="my-6 ml-6 list-disc text-sm [&>li]:mt-2">
          <li>
            10% от стоимости, но не менее 1000 руб. – за шкафы-купе, распашные
            шкафы, компьютерные столы, стеллажи, серванты, библиотеки, комоды и
            тумбы для обуви (сборка в течение нескольких дней после доставки);
          </li>
          <li>
            10% от стоимости, но не менее 1500 руб. – за прихожие, стенки,
            спальни и модульные изделия (сборка в течение нескольких дней после
            доставки);
          </li>
          <li>
            10%, но не менее 500 руб. – за журнальные столики (сборка при
            доставке);
          </li>
          <li>
            15% от стоимости, но не менее 1500 руб. – за встроенные шкафы и
            приравненные к ним (когда с каждой стороны и/или сверху менее 10 см.
            свободного пространства).
          </li>
          <li>Навеска мебели оплачивается дополнительно в размере:</li>

          <ul class="my-2 ml-6 list-disc text-sm [&>li]:mt-2">
            <li>тумбы 400 ₽ /модуль</li>
            <li>зеркала 600 ₽ /шт</li>
            <li>полки 300 ₽ /шт.</li>
          </ul>

          <li>
            Подключение подсветки оплачивается дополнительно: 1000 ₽ -
            подключение + 350 ₽/светильник или пог. метр.
          </li>
        </ul>

        <p class="text-sm">
          Мы доставляем мебель собственной курьерской службой в регионах:
          Москва, Московская область, Санкт-Петербург, Ленинградская область,
          Владимир, Владимирская область. В остальные регионы доставка может
          быть осуществлена Вами, как самостоятельно, так и с нашей помощью
          через транспортную компанию. При заказе мебели в регионы мы можем
          обеспечить доставку груза до терминала ТК. Подробные условия всегда
          можно уточнить у наших менеджеров.
        </p>

        <h3 class="scroll-m-20 text-xl font-medium">
          Доставка мебели по России
        </h3>

        <p class="text-sm">
          Мы доставляем мебель собственной курьерской службой в регионах:
          Москва, Московская область, Санкт-Петербург, Ленинградская область,
          Владимир, Владимирская область. В остальные регионы доставка может
          быть осуществлена Вами, как самостоятельно, так и с нашей помощью
          через транспортную компанию. При заказе мебели в регионы мы можем
          обеспечить доставку груза до терминала ТК. Подробные условия всегда
          можно уточнить у наших менеджеров.
        </p>
      </div>
    </SheetContent>
  </Sheet>
</template>
