<script setup lang="ts">
import {
  Sheet,
  SheetClose,
  SheetContent,
  SheetDescription,
  SheetFooter,
  SheetHeader,
  SheetTitle,
  SheetTrigger
} from "~/shared/ui/sheet"

import ModalTable from "./modal-table.vue"
</script>

<template>
  <Sheet>
    <SheetTrigger as-child>
      <slot />
    </SheetTrigger>
    <SheetContent class="py-2 pb-8 sm:max-w-lg">
      <SheetHeader class="px-8">
        <SheetTitle class="text-2xl">Оплата</SheetTitle>
      </SheetHeader>
      <div class="w-full space-y-6 overflow-y-auto px-8">
        <p class="text-sm">
          При заказе стандартного изделия из каталога сайта стоимостью от 30 000
          рублей, на него распространяется Акция «Бесплатная доставка». Акция
          действует только по г. Москва, в пределах МКАД. Доставка за МКАД
          оплачивается дополнительно, стоимость - 40 ₽/км (до 80 км от МКАД) и
          50 ₽/км (от 80 км от МКАД). Акция «Бесплатная доставка» не применяется
          при покупке мебели в Рассрочку и не суммируется с промокодами. О
          наличии акций в других регионах уточняйте у менеджера по телефону
          компании.
        </p>

        <h3 class="scroll-m-20 text-xl font-medium">
          Предоплата нужна в следующих случаях
        </h3>

        <h4 class="scroll-m-12 text-lg font-medium">Стандартные изделия</h4>

        <ul class="my-6 ml-6 list-disc text-sm [&>li]:mt-2">
          <li>
            От 70 000 рублей предоплата составляет 15%. До 70 000 предоплата не
            требуется.
          </li>
          <li>
            Заказ запускается в работу после проведения оплаты. Остальная часть
            оплачивается при доставке. Курьер выдаст вам накладную о получении,
            кассовый и товарные чеки — по запросу. Если оплата полностью
            проводится онлайн — документы отправляем на электронную почту.
          </li>
          <li>При работе с юридическими лицами — предоплата 100%.</li>
          <li>
            При отправке через транспортные компании в другие регионы России
            (помимо регионов присутствия собственной доставки) — предоплата
            100%.
          </li>
        </ul>

        <h4 class="scroll-m-12 text-lg font-medium">
          Индивидуальные заказы (по вашим проектам)
        </h4>

        <ul class="my-6 ml-6 list-disc text-sm [&>li]:mt-2">
          <li>
            После согласования всех деталей заказа, перед запуском на
            производство предоплата необходима в размере 30%.
          </li>
          <li>
            Оплата производится онлайн, все документы сразу приходят на
            электронную почту. При доставке товара, после подписания Акта
            приемки-передачи изделий, вы оплачиваете оставшуюся часть.
          </li>
          <li>При работе с юридическими лицами — предоплата 100%.</li>
          <li>
            При отправке через транспортные компании в другие регионы России
            (помимо регионов присутствия собственной доставки) — предоплата
            100%.
          </li>
        </ul>

        <blockquote class="mt-6 border-l-2 pl-6 text-sm italic">
          Рассрочка — это форма кредита (займа), при которой переплаты по
          кредиту (займу) не возникает за счет скидки на товар, предоставляемой
          продавцом. Процентная ставка по продукту «Рассрочка» — от 6,709% до
          70% годовых. Минимальная сумма — 3000 р., максимальная сумма — 500 000
          р. Срок предоставления — от 3 до 6 месяцев. Ваш тариф и размер
          ежемесячного платежа будет определен по результатам рассмотрения
          заявки. Подробнее на сайте www.tbank.ru. АО «ТБанк», ООО

          <br />
          <br />

          «Микрофинансовая компания «Т-Финанс». При заказе мебели в рассрочку не
          применяются Акция «Бесплатная доставка» и акции по промокодам. О
          возможности применения скидок уточняйте у менеджера при подтверждении
          заказа.
        </blockquote>
      </div>
    </SheetContent>
  </Sheet>
</template>
